app/views/orders/_line_items.html.erb

    <%= f.label :product_id %>
    <%= f.collection_select :product_id, Product.all, :id, :title %>
---
SELECT `products`.* FROM `products`