app/views/orders/index.html.erb

      <tr>
        <td class="tableElementWithBorder"><%= order.order_status %></td>
---
SELECT `orders`.* FROM `orders`