app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`created_at`, `order_status`, `payment_method`, `purchase_surname`, `purchaser_name`, `shipping_address`, `shipping_city`, `updated_at`) VALUES ('2014-03-15 12:16:42', 'shipped', 'visa', 'aranda', 'alvaro', 'address1', 'madrid', '2014-03-15 12:16:42')

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `shipping_city` = 'Madrid', `purchaser_name` = 'Alvaro', `purchase_surname` = 'Aranda', `updated_at` = '2014-03-23 13:42:54' WHERE `orders`.`id` = 5

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 2