app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`category`, `created_at`, `description`, `in_stock_date`, `manufacturer`, `quantity`, `title`, `updated_at`) VALUES ('cat1', '2014-03-15 15:12:56', 'Producto 2 Descripción', '2014-03-15 15:12:00', 'manufacturer2', 10, 'Producto 3', '2014-03-15 15:12:56')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `category` = 'cat1', `updated_at` = '2014-03-15 13:40:44' WHERE `products`.`id` = 2